run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/capillaryGorterMellink_g/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

Lx 15;
Ly 0.5;
vertices        
(
    (0 0 0)
    ($Lx 0 0)
    ($Lx $Ly 0)
    (0 $Ly 0)
    (0 0 0.1)
    ($Lx 0 0.1)
    ($Lx $Ly 0.1)
    (0 $Ly 0.1)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (120 10 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(

    inlet 
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet 
    {
        type patch;
        faces
        (
            (2 6 5 1) 
        );
    }
    fixedWalls 
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    symmetryPlane 
    {
        type symmetryPlane;
        faces
        (
			(3 7 6 2)
        );
    }

    frontAndBack 
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
