run/tutorials/heatTransfer/buoyantBoussinesqSuperFluidPimpleFoam/capillaryGorterMellink_g/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

interpolationScheme cell;

// Fields to sample.
fields
(
	T
	p
);

sets
(
    lineX1
    {
        type        midPoint;
        axis        distance;

        start       (0 		0.0005 0.00005);
        end         (0.015 0.0005 0.00005);
    }
);


// *********************************************************************** //
